{"description": "Esme loves Shabbat with her Nanny Sally. They go to the market to buy purple flowers with green wrapping. They come home and set the table with the Shabbat candles. They warm the challah in the oven. The whole family comes over (Ol, Mum, Dad, Sophie, Dan and Jeremy). They sit around the table and eat together and all talk together. ", "character_description": "4 years old with dark, curly brown hair, light green eyes and fair skin wearing a blue dress", "story_text": "\"Esme's Special Shabbat\"\n\nOn Friday morning, bright and clear,\nEsme bounces with happy cheer.\n\"Nanny Sally, shall we go today,\nTo find some flowers for our special day?\"\n\nThrough market stalls they dance and weave,\nPast fruits and treats you won't believe.\nTill purple blooms catch Esme's eye,\nWrapped in green, reaching to the sky.\n\nHome they rush to set the scene,\nMaking everything sparkle and gleam.\nThe challah warms with golden grace,\nWhile candles find their special place.\n\nBut wait! The tablecloth has a tear!\n\"Oh no!\" says Esme with despair.\nThen quick as lightning comes her thought:\n\"Let's use the cloth that Bubbie brought!\"\n\nThe doorbell chimes - who could it be?\nOl, Mum and Dad, plus siblings three!\nSophie, Dan, and Jeremy too,\nAll gather 'round - the whole loving crew.\n\nTogether they share this precious night,\nStories and laughter, pure delight.\nFor Shabbat brings more than food to eat,\nIt's family love that makes it sweet.", "simplified_text": "I see a happy day.\nIt is Friday now.\nEsme wants to go.\nLet's get some flowers.\n\nWe go to the shop.\nLook at all the food.\nEsme sees purple flowers.\nThe flowers are big.\n\nWe go back home.\nWe make it clean.\nThe bread is hot.\nThe candles sit here.\n\nOh no! A big rip!\nEsme is sad.\nBut she can fix it.\nShe gets a new cloth.\n\nThe door goes ding.\nMom and Dad are here.\nSee all the kids.\nThey come to play.\n\nWe sit and eat.\nWe laugh and play.\nWe like this time.\nThe family is here.", "image_descriptions": ["Title text \"Esme's Special Shabbat\" with cheerful 4-year-old girl character smiling", "Excited 4-year-old Esme jumping next to elderly Nanny Sally in sunny morning kitchen", "Esme and Nanny Sally exploring vibrant market stalls, Esme pointing at purple flowers", "Esme helping arrange golden challah bread and silver candlesticks on dining table", "Esme looking worried at torn tablecloth, vintage embroidered cloth visible nearby", "Family arriving at front door - parents and three siblings greeting excited Esme", "Whole family gathered around decorated Shabbat table, sharing food and smiling together"], "temp_id": "1ad41b17-a7e4-42ed-a5f9-24f1a8b0a4da", "created_at": "2025-04-25T08:40:53.056388"}